// a.sort(function(a,b){
// 	if(a.length != b.length){
// 		return (a.length > b.length)? 1 : -1;
// 	}else{
// 		let aa = 0;
// 		for(let z=0,zl=a.length;z<zl;z++){
// 			if(a[z].charCodeAt() != b[z].charCodeAt()){
// 				aa = (a[z].charCodeAt() > b[z].charCodeAt()) ? 1 : -1;
// 				break;
// 			}
// 		}
// 		return aa;
// 	}
// })


var data = [
	{
		"code": "01",
		"name": "公共场所",
		"parent": null
	},
	{
		"code": "0101",
		"name": "行政处罚决定",
		"parent": "01"
	},
	{
		"code": "010101",
		"name": "警告",
		"parent": "0101"
	},
	{
		"code": "010102",
		"name": "罚款",
		"parent": "0101"
	},
	{
		"code": "010103",
		"name": "停业整顿",
		"parent": "0101"
	},
	{
		"code": "010104",
		"name": "吊销卫生许可证",
		"parent": "0101"
	},
	{
		"code": "0102",
		"name": "行政强制及其措施",
		"parent": "01"
	},
	{
		"code": "010201",
		"name": "责令改正",
		"parent": "0102"
	},
	{
		"code": "010202",
		"name": "封闭场所",
		"parent": "0102"
	},
	{
		"code": "010203",
		"name": "封存相关物品",
		"parent": "0102"
	},
	{
		"code": "010204",
		"name": "其他",
		"parent": "0102"
	},
	{
		"code": "0103",
		"name": "其他处理情况",
		"parent": "01"
	},
	{
		"code": "010301",
		"name": "移送司法机关",
		"parent": "0103"
	},
	{
		"code": "010302",
		"name": "通报其他部门",
		"parent": "0103"
	},
	{
		"code": "010303",
		"name": "其他",
		"parent": "0103"
	},
	{
		"code": "02",
		"name": "生活饮用水",
		"parent": null
	},
	{
		"code": "0201",
		"name": "行政处罚决定",
		"parent": "02"
	},
	{
		"code": "020101",
		"name": "罚款",
		"parent": "0201"
	},
	{
		"code": "020102",
		"name": "其他",
		"parent": "0201"
	},
	{
		"code": "0202",
		"name": "行政强制及其措施",
		"parent": "02"
	},
	{
		"code": "020201",
		"name": "责令限期改进",
		"parent": "0202"
	},
	{
		"code": "020202",
		"name": "其他",
		"parent": "0202"
	},
	{
		"code": "0203",
		"name": "其他处理情况",
		"parent": "02"
	},
	{
		"code": "020301",
		"name": "移送司法机关",
		"parent": "0203"
	},
	{
		"code": "020302",
		"name": "通报有关部门",
		"parent": "0203"
	},
	{
		"code": "020303",
		"name": "其他",
		"parent": "0203"
	},
	{
		"code": "03",
		"name": "职业卫生",
		"parent": null
	},
	{
		"code": "0301",
		"name": "行政处罚决定",
		"parent": "03"
	},
	{
		"code": "030101",
		"name": "警告",
		"parent": "0301"
	},
	{
		"code": "030102",
		"name": "罚款",
		"parent": "0301"
	},
	{
		"code": "030103",
		"name": "没收违法所得",
		"parent": "0301"
	},
	{
		"code": "030104",
		"name": "没收收受的财物",
		"parent": "0301"
	},
	{
		"code": "030105",
		"name": "其他",
		"parent": "0301"
	},
	{
		"code": "0302",
		"name": "行政强制及其措施",
		"parent": "03"
	},
	{
		"code": "030201",
		"name": "责令限期改正",
		"parent": "0302"
	},
	{
		"code": "030202",
		"name": "责令立即停止违法行为",
		"parent": "0302"
	},
	{
		"code": "030203",
		"name": "取消资格",
		"parent": "0302"
	},
	{
		"code": "030204",
		"name": "其他",
		"parent": "0302"
	},
	{
		"code": "0303",
		"name": "其他处理情况",
		"parent": "03"
	},
	{
		"code": "030301",
		"name": "移送司法机",
		"parent": "0303"
	},
	{
		"code": "030302",
		"name": "行政处分",
		"parent": "0303"
	},
	{
		"code": "030303",
		"name": "通报有关部门",
		"parent": "0303"
	},
	{
		"code": "030304",
		"name": "其他",
		"parent": "0303"
	},
	{
		"code": "04",
		"name": "放射诊疗",
		"parent": null
	},
	{
		"code": "0401",
		"name": "行政处罚决定",
		"parent": "04"
	},
	{
		"code": "040101",
		"name": "警告",
		"parent": "0401"
	},
	{
		"code": "040102",
		"name": "罚款",
		"parent": "0401"
	},
	{
		"code": "040103",
		"name": "吊销许可证",
		"parent": "0401"
	},
	{
		"code": "040104",
		"name": "其他",
		"parent": "0401"
	},
	{
		"code": "0402",
		"name": "行政强制及其措施",
		"parent": "04"
	},
	{
		"code": "040201",
		"name": "责令限期改正",
		"parent": "0402"
	},
	{
		"code": "040202",
		"name": "其他",
		"parent": "0402"
	},
	{
		"code": "0403",
		"name": "其他处理情况",
		"parent": "04"
	},
	{
		"code": "040301",
		"name": "移送司法机关",
		"parent": "0403"
	},
	{
		"code": "040302",
		"name": "通报有关部门",
		"parent": "0403"
	},
	{
		"code": "040303",
		"name": "其他",
		"parent": "0403"
	},
	{
		"code": "05",
		"name": "学校卫生",
		"parent": null
	},
	{
		"code": "0501",
		"name": "行政处罚决定",
		"parent": "05"
	},
	{
		"code": "050101",
		"name": "警告",
		"parent": "0501"
	},
	{
		"code": "050102",
		"name": "其他",
		"parent": "0501"
	},
	{
		"code": "0502",
		"name": "行政强制及其措施",
		"parent": "05"
	},
	{
		"code": "050201",
		"name": "责令限期改进",
		"parent": "0502"
	},
	{
		"code": "050202",
		"name": "其他",
		"parent": "0502"
	},
	{
		"code": "0503",
		"name": "其他处理情况",
		"parent": "05"
	},
	{
		"code": "050301",
		"name": "移送司法机关",
		"parent": "0503"
	},
	{
		"code": "06",
		"name": "医疗机构",
		"parent": null
	},
	{
		"code": "0601",
		"name": "行政处罚决定",
		"parent": "06"
	},
	{
		"code": "060101",
		"name": "警告",
		"parent": "0601"
	},
	{
		"code": "060102",
		"name": "罚款",
		"parent": "0601"
	},
	{
		"code": "060103",
		"name": "没收违法所得",
		"parent": "0601"
	},
	{
		"code": "060104",
		"name": "没收药品器械",
		"parent": "0601"
	},
	{
		"code": "060105",
		"name": "吊销执业许可证",
		"parent": "0601"
	},
	{
		"code": "060106",
		"name": "吊销诊疗科目",
		"parent": "0601"
	},
	{
		"code": "060107",
		"name": "吊销执业证书",
		"parent": "0601"
	},
	{
		"code": "060108",
		"name": "其他",
		"parent": "0601"
	},
	{
		"code": "060109",
		"name": "责令暂停执业活动",
		"parent": "0601"
	},
	{
		"code": "060110",
		"name": "暂扣乡村医生证",
		"parent": "0601"
	},
	{
		"code": "0602",
		"name": "行政强制及其措施",
		"parent": "06"
	},
	{
		"code": "060201",
		"name": "责令改正",
		"parent": "0602"
	},
	{
		"code": "060202",
		"name": "责令停止执业",
		"parent": "0602"
	},
	{
		"code": "060203",
		"name": "责令限期补办校验手续",
		"parent": "0602"
	},
	{
		"code": "060206",
		"name": "其他",
		"parent": "0602"
	},
	{
		"code": "060207",
		"name": "查封",
		"parent": "0602"
	},
	{
		"code": "060208",
		"name": "扣押",
		"parent": "0602"
	},
	{
		"code": "0603",
		"name": "其他处理情况",
		"parent": "06"
	},
	{
		"code": "060301",
		"name": "移送司法机关",
		"parent": "0603"
	},
	{
		"code": "060302",
		"name": "行政处分",
		"parent": "0603"
	},
	{
		"code": "07",
		"name": "传染病防治",
		"parent": null
	},
	{
		"code": "0701",
		"name": "消毒产品单位",
		"parent": "07"
	},
	{
		"code": "070101",
		"name": "行政处罚决定",
		"parent": "0701"
	},
	{
		"code": "07010101",
		"name": "罚款",
		"parent": "070101"
	},
	{
		"code": "07010102",
		"name": "没收违法所得",
		"parent": "070101"
	},
	{
		"code": "07010103",
		"name": "其他",
		"parent": "070101"
	},
	{
		"code": "070102",
		"name": "行政强制及其措施",
		"parent": "0701"
	},
	{
		"code": "07010201",
		"name": "责令限期改正",
		"parent": "070102"
	},
	{
		"code": "07010202",
		"name": "其他",
		"parent": "070102"
	},
	{
		"code": "070103",
		"name": "其他处理情况",
		"parent": "0701"
	},
	{
		"code": "07010301",
		"name": "移送司法机关",
		"parent": "070103"
	},
	{
		"code": "07010302",
		"name": "其他",
		"parent": "070103"
	},
	{
		"code": "0703",
		"name": "疾病预防控制机构、医疗机构、采供血机构",
		"parent": "07"
	},
	{
		"code": "070301",
		"name": "行政处罚决定",
		"parent": "0703"
	},
	{
		"code": "07030101",
		"name": "警告",
		"parent": "070301"
	},
	{
		"code": "07030102",
		"name": "罚款",
		"parent": "070301"
	},
	{
		"code": "07030103",
		"name": "没收违法所得",
		"parent": "070301"
	},
	{
		"code": "07030104",
		"name": "暂扣许可证、执业证书",
		"parent": "070301"
	},
	{
		"code": "07030105",
		"name": "吊销许可证、执业证书",
		"parent": "070301"
	},
	{
		"code": "07030106",
		"name": "其他",
		"parent": "070301"
	},
	{
		"code": "070302",
		"name": "行政强制及其措施",
		"parent": "0703"
	},
	{
		"code": "07030201",
		"name": "责令限期改正",
		"parent": "070302"
	},
	{
		"code": "07030202",
		"name": "责令停止有关活动",
		"parent": "070302"
	},
	{
		"code": "07030203",
		"name": "封闭公共饮用水源、封存食品及相关物品或暂停销售的临时控制措施",
		"parent": "070302"
	},
	{
		"code": "07030204",
		"name": "查封或者暂扣涉嫌违反《医疗废物管理条例》规定的场所、设备、运输工具和物品",
		"parent": "070302"
	},
	{
		"code": "07030205",
		"name": "取缔",
		"parent": "070302"
	},
	{
		"code": "07030206",
		"name": "提请人民政府责令停建、关闭",
		"parent": "070302"
	},
	{
		"code": "07030207",
		"name": "其他",
		"parent": "070302"
	},
	{
		"code": "070303",
		"name": "其他处理情况",
		"parent": "0703"
	},
	{
		"code": "07030301",
		"name": "移送司法机关",
		"parent": "070303"
	},
	{
		"code": "07030302",
		"name": "行政处分",
		"parent": "070303"
	},
	{
		"code": "0704",
		"name": "餐饮具集中消毒单位",
		"parent": "07"
	},
	{
		"code": "070401",
		"name": "行政处罚决定",
		"parent": "0704"
	},
	{
		"code": "07040101",
		"name": "警告",
		"parent": "070401"
	},
	{
		"code": "07040102",
		"name": "罚款",
		"parent": "070401"
	},
	{
		"code": "07040103",
		"name": "责令停产停业",
		"parent": "070401"
	},
	{
		"code": "07040104",
		"name": "其他",
		"parent": "070401"
	},
	{
		"code": "070402",
		"name": "行政强制及其措施",
		"parent": "0704"
	},
	{
		"code": "07040201",
		"name": "责令限期改正",
		"parent": "070402"
	},
	{
		"code": "07040202",
		"name": "其他",
		"parent": "070402"
	},
	{
		"code": "070403",
		"name": "其他处理情况",
		"parent": "0704"
	},
	{
		"code": "07040301",
		"name": "移送司法机关",
		"parent": "070403"
	},
	{
		"code": "07040302",
		"name": "通报其他部门",
		"parent": "070403"
	},
	{
		"code": "07040303",
		"name": "其他",
		"parent": "070403"
	},
	{
		"code": "08",
		"name": "血液安全",
		"parent": null
	},
	{
		"code": "0801",
		"name": "行政处罚决定",
		"parent": "08"
	},
	{
		"code": "080101",
		"name": "警告",
		"parent": "0801"
	},
	{
		"code": "080102",
		"name": "罚款",
		"parent": "0801"
	},
	{
		"code": "080103",
		"name": "没收违法所得",
		"parent": "0801"
	},
	{
		"code": "080104",
		"name": "没收从事违法活动的器材、设备",
		"parent": "0801"
	},
	{
		"code": "080105",
		"name": "吊销许可证",
		"parent": "0801"
	},
	{
		"code": "080106",
		"name": "其他",
		"parent": "0801"
	},
	{
		"code": "0802",
		"name": "行政强制及其措施",
		"parent": "08"
	},
	{
		"code": "080201",
		"name": "责令改正",
		"parent": "0802"
	},
	{
		"code": "080202",
		"name": "限期整顿",
		"parent": "0802"
	},
	{
		"code": "080204",
		"name": "其他",
		"parent": "0802"
	},
	{
		"code": "0803",
		"name": "其他处理情况",
		"parent": "08"
	},
	{
		"code": "080301",
		"name": "移送司法机关",
		"parent": "0803"
	},
	{
		"code": "080302",
		"name": "行政处分",
		"parent": "0803"
	},
	{
		"code": "09",
		"name": "计划生育",
		"parent": null
	},
	{
		"code": "0901",
		"name": "行政处罚决定",
		"parent": "09"
	},
	{
		"code": "090101",
		"name": "警告",
		"parent": "0901"
	},
	{
		"code": "090102",
		"name": "罚款",
		"parent": "0901"
	},
	{
		"code": "090103",
		"name": "没收违法所得",
		"parent": "0901"
	},
	{
		"code": "090104",
		"name": "没收药品器械",
		"parent": "0901"
	},
	{
		"code": "090105",
		"name": "责令暂停执业活动",
		"parent": "0901"
	},
	{
		"code": "090106",
		"name": "吊销执业许可证",
		"parent": "0901"
	},
	{
		"code": "090107",
		"name": "吊销执业证书",
		"parent": "0901"
	},
	{
		"code": "090108",
		"name": "其他",
		"parent": "0901"
	},
	{
		"code": "0902",
		"name": "行政强制及其措施",
		"parent": "09"
	},
	{
		"code": "090201",
		"name": "查封",
		"parent": "0902"
	},
	{
		"code": "090202",
		"name": "扣押",
		"parent": "0902"
	},
	{
		"code": "090203",
		"name": "责令改正",
		"parent": "0902"
	},
	{
		"code": "090204",
		"name": "责令停止执业活动",
		"parent": "0902"
	},
	{
		"code": "090205",
		"name": "责令限期补办校验手续",
		"parent": "0902"
	},
	{
		"code": "090206",
		"name": "其他",
		"parent": "0902"
	},
	{
		"code": "0903",
		"name": "其他处理情况",
		"parent": "09"
	},
	{
		"code": "090301",
		"name": "移送司法机关",
		"parent": "0903"
	},
	{
		"code": "090302",
		"name": "行政处分",
		"parent": "0903"
	},
	{
		"code": "020",
		"name": "无证行医",
		"parent": null
	},
	{
		"code": "02001",
		"name": "行政处罚决定",
		"parent": "020"
	},
	{
		"code": "0200101",
		"name": "罚款",
		"parent": "02001"
	},
	{
		"code": "0200102",
		"name": "没收违法所得",
		"parent": "02001"
	},
	{
		"code": "0200103",
		"name": "没收药品器械",
		"parent": "02001"
	},
	{
		"code": "02002",
		"name": "行政强制及其措施",
		"parent": "020"
	},
	{
		"code": "0200201",
		"name": "取缔",
		"parent": "02002"
	},
	{
		"code": "0200202",
		"name": "责令停止执业活动",
		"parent": "02002"
	},
	{
		"code": "0200203",
		"name": "其他",
		"parent": "02002"
	},
	{
		"code": "02003",
		"name": "其他处理情况",
		"parent": "020"
	},
	{
		"code": "0200301",
		"name": "移送司法机关",
		"parent": "02003"
	},
	{
		"code": "0200302",
		"name": "移送其他部门",
		"parent": "02003"
	}
];

module.exports = data;